#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_appautoscaling_policy.ECS_Green_Target_CPU will be created
  + resource "aws_appautoscaling_policy" "ECS_Green_Target_CPU" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "green-application-scaling-policy-cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/Exam-Cluster/Exam-Green"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # aws_appautoscaling_policy.ECS_Green_Target_Memory will be created
  + resource "aws_appautoscaling_policy" "ECS_Green_Target_Memory" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "green-application-scaling-policy-memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/Exam-Cluster/Exam-Green"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # aws_appautoscaling_target.ECS_Green_Target will be created
  + resource "aws_appautoscaling_target" "ECS_Green_Target" {
      + id                 = (known after apply)
      + max_capacity       = 8
      + min_capacity       = 4
      + resource_id        = "service/Exam-Cluster/Exam-Green"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # aws_ecs_service.VPC_ECS_Service_Green will be created
  + resource "aws_ecs_service" "VPC_ECS_Service_Green" {
      + cluster                            = "arn:aws:ecs:eu-central-1:068379437484:cluster/Exam-Cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 4
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "EC2"
      + name                               = "Exam-Green"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "Exam"
          + "Name"        = "Exam-Green ECS Service"
          + "Owner"       = "Rainbow Gravity"
          + "Project"     = "Template Homework"
        }
      + tags_all                           = {
          + "Environment" = "Exam"
          + "Name"        = "Exam-Green ECS Service"
          + "Owner"       = "Rainbow Gravity"
          + "Project"     = "Template Homework"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "Exam-Green-Container"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:068379437484:targetgroup/Exam-20211021185027364500000003/f00031765c632848"
        }

      + ordered_placement_strategy {
          + field = "attribute:ecs.availability-zone"
          + type  = "spread"
        }
      + ordered_placement_strategy {
          + field = "instanceId"
          + type  = "spread"
        }
    }

  # aws_ecs_task_definition.Task_Green will be created
  + resource "aws_ecs_task_definition" "Task_Green" {
      + arn                   = (known after apply)
      + container_definitions = jsonencode(
            [
              + {
                  + cpu          = 128
                  + essential    = true
                  + image        = "068379437484.dkr.ecr.eu-central-1.amazonaws.com/python-app-green:gruen"
                  + memory       = 128
                  + name         = "Exam-Green-Container"
                  + portMappings = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 0
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + family                = "Exam-Green-APP"
      + id                    = (known after apply)
      + network_mode          = (known after apply)
      + revision              = (known after apply)
      + tags                  = {
          + "Environment" = "Exam"
          + "Name"        = "Exam-Green ECS Task"
          + "Owner"       = "Rainbow Gravity"
          + "Project"     = "Template Homework"
        }
      + tags_all              = {
          + "Environment" = "Exam"
          + "Name"        = "Exam-Green ECS Task"
          + "Owner"       = "Rainbow Gravity"
          + "Project"     = "Template Homework"
        }

      + volume {
          + host_path = "/ecs/service-storage"
          + name      = "service-storage"
        }
    }

  # aws_lb_listener.VPC_Green_Load_Balancer_Listener_8080 will be created
  + resource "aws_lb_listener" "VPC_Green_Load_Balancer_Listener_8080" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:068379437484:loadbalancer/app/Exam-20211021185032691000000006/3128abe34a9e0ca8"
      + port              = 8080
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:068379437484:targetgroup/Exam-20211021185027364500000003/f00031765c632848"
          + type             = "forward"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @RainbowGravity, Action: `pull_request`, Workflow: `Production env`*